{
  "Header.Item1": "About me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "resume.pdf",

  "Banner.Pretitle": "Hey there ! My name is",
  "Banner.Description": "I have <span class='underline'>3+ years of experience</span> developing systems, interfaces, bots, and technological solutions to make the web and mobile app a better place. I am dedicated to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular</span> and <span class='underline'>Node.js</span> applying good practices and development standards.",
  "Banner.ActionBtn": "Get in touch",

  "AboutMe.Title": "About me",
  "AboutMe.Paragraphs": [
    "In my <span class='underline'>3 years as a developer</span>, I seek to train every day. I have worked writing <span class='underline'>Clean & Reusable code</span>, Creating Database Architecture, and covering backend developer roles with <span class='underline'>Node.js and Mysql</span>. I have led teams having empathy, exercising motivation to partners, and setting plans and goals together.",
    "My skills also include implementing system improvements, optimizing sites, standardizing patterns, and suggesting and executing ideas that add value to the project I'm working on.",
    "Some of the technologies that I have trained and worked on include (but are not limited to):"
  ],

  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "Projects",
      "Title": "Fullstack developer",
      "Date": "August 2020 - Present",
      "Description": [
        "Creation and maintenance of a monitoring platform with mircoservices in NestJs.",
        "Functional programming in templates and plugins to add the necessary monitoring features.",
        "Implementation of continuous integration and daily backups.",
        "Creation and maintenance of a second Monitoring Platform Done in Angular, Angular Material, Node.js, Mysql, RxJS, Sass with graphics (configurable), alarm system, and user management and configuration of general parameters.",
        "Planning meetings in reports."
      ]
    },
    {
      "Tab": "Lenditt",
      "Title": "Senior software developer",
      "Date": "Oct 2020 - Present",
      "Description": [
        "Leading a team of 7 developers in the development of a Animal welfare platform made in Angular, Node.js, and PostgreSQL.",
        "Implementation Database Architecture, Refactoring and optimizing application load times.",
        "Coding of API requests with RxJS.",
        "Creation of modules with complex reactive forms",
        "Writing weekly reports about goals and plans."
      ]
    },
    {
      "Tab": "Welspun",
      "Title": "Graduate engineer trainee",
      "Date": "Jun 2019 - Sept 2020",
      "Description": [
        "Creation of mircoservices in NestJs with ACF, functional programming in Javascript / TypeScript",
        "integration of design improvements, and template loading times.",
        "Effective communication with the design team, working with Avocode / Figma."
      ]
    }
  ],

  "FeatureProjects.Title": "My projects",
  "FeatureProjects.Label": "Featured Project",
  "FeatureProjects.Projects": [
    {
      "Title": "Quicko",
      "Description": "Participated in <span class='underline'>Agile software development practices & workflows</span>, Worked on a FinTech product(Tax preparation & filing platform). Explored rich technology stack consisting Angular applications like product web-apps & product dashboard",
      "imgs": [
        "assets/images/quicko_images/one.png",
        "assets/images/quicko_images/two.svg",
        "assets/images/quicko_images/three.jpg"
      ],
      "Technologies": [
        "Angular",
        "Node.js",
        "SASS",
        "Angular Material",
        "Java",
        "RxJS"
      ]
    },
    {
      "Title": "Lenditt - Your Financial buddy",
      "Description": "Used advanced concepts of Angualar like <span class='underline'>RxJS, NgRx (State-Management)</span>, Lazy loading & Angular Material, Reactive forms in multiple projects. Worked on a FinTech product(NBFC digital lending platform). With leading Technology stack consisting of Angular applications for product dashboard & tools, NodeJS (NestJS) backend service, <span class='underline'>PostgreSQL & Firebase NoSQL</span> database.",
      "imgs": [
        "assets/images/lenditt_images/one.jpg",
        "assets/images/lenditt_images/two.webp",
        "assets/images/lenditt_images/three.webp"
      ],
      "Technologies": ["Node.js", "Dart", "Flutter", "Postgres", "Python"]
    },
    {
      "Title": "Fairdogs",
      "Description": "Worked on a animal welfate platform where users can seek animal care and animals care collaborate in order to better protect animals. It consists of rich technology stack consists of Angular web application, Angular admin panel, Node.js mircoservices, <span class='underline'>MySQL, MongoDB.</span> It also has partial integration for wordpress.",
      "imgs": [
        "assets/images/fairdogs_images/pic1.png",
        "assets/images/fairdogs_images/pic2.png",
        "assets/images/fairdogs_images/pic3.png"
      ],
      "Technologies": ["Node.js", "Angular", "SASS", "Angular Material", "RxJS"]
    },
    {
      "Title": "Hands game",
      "Description": "The rock-paper-scissors game extended. A personal project developed in angular in which you play randomly against the machine. It has the use of services, interfaces, and components.",
      "imgs": ["assets/images/hands-game.png"],
      "Technologies": ["Angular", "CSS GRID", "SASS", "Angular animations"]
    },
    {
      "Title": "Countries viewer",
      "Description": "An interface that consumes an API of countries with which you can view a list of countries, see details of each country, filter by name and region. It also has a dark mode to switch between dark and light themes.",
      "imgs": ["assets/images/countries-viewer.png"],
      "Technologies": ["Angular", "RxJS", "SASS", "API"]
    }
  ],

  "OtherProjects.Title": "More projects",
  "OtherProjects.Projects": [
    {
      "Title": "Four card feature section",
      "Description": "A single page that has a minimal design, listing four features on four cards. Input animations are done with angular animations.",
      "Technologies": ["Angular", "SASS", "CSS GRID"]
    },
    {
      "Title": "Profile card",
      "Description": "Simple one-page design that features a profile letter with basic information about a person.",
      "Technologies": ["Angular", "SASS", "GIT"]
    },
    {
      "Title": "Coming soon page",
      "Description": "Personal project of a two-column split page to be used as a 'Coming soon page'. Scheduled to be a fully responsive design. It has a form field to subscribe by email.",
      "Technologies": ["Angular", "SASS", "CSS GRID", "Reactive form"]
    }
  ],
  "Contact.Pretitle": "What’s Next",
  "Contact.Title": "Get in touch!",
  "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
  "Contact.Btn": "Say Hello"
}
